<script>
 export default {
        name: "AnimeFilmCard",
        data () {
            return {
                animefilms: [
                {
                    id: 0,
                    titlerussian: "Твой цвет",
                    titlejapanese: "Kimi no Iro",
                    season: "30.08.2024",
                    genres: [{idG: 0, genreName: "драма"}],
                    posterUrl: "kimi-no-iro.jpg",
                    about: "Тоцуко, старшеклассница с удивительным даром, видит цвета эмоций людей вокруг. Её мир переливается оттенками счастья, восторга и умиротворения, но один цвет кажется ей особенным, словно предначертанным судьбой. Когда Тоцуко, Кими и их друг Руи создают музыкальную группу, творчество помогает друзьям понять себя и друг друга."
                },
                {
                    id: 1,
                    titlerussian: "Оглянись",
                    titlejapanese: "ルックバック",
                    season: "28.06.2024",
                    genres: [{idG: 0, genreName: "повседневность"}, {idG: 1, genreName: "драма"}],
                    posterUrl: "oglyanis.jpg",
                    about: "Ученица четвёртого класса Фудзино, уверенная в себе и в своих способностях, рисует короткие комиксы для школьной газеты. Взрослые и одноклассники хвалят её талант, но однажды она встречает соперницу — одноклассницу Кёмото, которая, хоть и не посещает школу, тоже рисует для той же газеты. Поражённая уровнем мастерства Кёмото и пытаясь угнаться за ней, Фудзино бросает все силы на то, чтобы научиться лучше рисовать, но все её усилия тщетны. И тогда девочка бросает попытки догнать соперницу и возвращается к обычной школьной жизни. Всё меняет день, когда они волею судеб встретились…"
                },
                {
                    id: 2,
                    titlerussian: "Моя подруга демон",
                    titlejapanese: "Suki demo Kirai na Amanojaku",
                    season: "24.05.2024",
                    genres: [{idG: 0, genreName: "приключения"}, {idG: 1, genreName: "фэнтэзи"}],
                    posterUrl: "suki-demo-kirai-na-amanojaku.jpg",
                    about: "Хиираги безуспешно пытается завести друзей, но в сущности никому не нужен и не интересен. Случайно, на летнем фестивале он знакомится со странной девушкой Цумуги, которая ищет свою мать в человеческом мире. Вместе они отправляются в путешествие к таинственному храму, преследуемые опасными существами – то ли снежными богами, то ли монстрами."
                },
                {
                    id: 3,
                    titlerussian: "Винокурня семьи Комада",
                    titlejapanese: "Komada Jouryuusho e Youkoso",
                    season: "10.11.2023",
                    genres: [{idG: 0, genreName: "повседневность"}],
                    posterUrl: "komada-jouryuusho-e-youkoso.jpg",
                    about: "В юности Руи была вынуждена взять на себя управление винокурней семейства Комада. Ещё при её отце производство серьёзно пострадало от землетрясения, и ей пришлось бросить учёбу, чтобы снова поставить его на ноги. Хотя сейчас винокурня процветает, девушка не может забыть о былых успехах. Она планирует воссоздать фирменный виски «Кома», который символизирует для неё единство их семьи. Однажды в винокурню по работе приезжает молодой репортер Котаро Такахаси, который поначалу не испытывает особого интереса к месту, но постепенно втягивается в тонкий и неторопливый процесс изготовления виски и проникается философией его употребления. Он решает помочь Руи в исполнении мечты."
                },
                {
                    id: 4,
                    titlerussian: "Консьерж универмага Арктика",
                    titlejapanese: "Hokkyoku Hyakkaten no Concierge-san",
                    season: "20.10.2023",
                    genres: [{idG: 0, genreName: "фэнтези"}],
                    posterUrl: "hokkyoku-hyakkaten-no-concierge-san.jpg",
                    about: "Производственная драмеди про любимую японцами философию сервиса в мире антропоморфных животных и людей. Акино постигает тонкости работы консьержа в огромном роскошном универсаме \"Арктика\", где рады каждому покупателю, от мала до велика, и где на любой кошелёк найдётся своя заветная покупка. Потому что клиент должен уходить из универсама счастливым - и возвращаться снова!"
                },
                {
                    id: 5,
                    titlerussian: "Плавучий дом",
                    titlejapanese: "Ame o Tsugeru Hyouryuu Danchi",
                    season: "16.09.2022",
                    genres: [{idG: 0, genreName: "приключения"}],
                    posterUrl: "ame-o-tsugeru-hyouryuu-danchi.jpg",
                    about: "Группа детей из 6-го класса младшей школы (по 11 лет от роду) забирается на крышу старого дома, готовящегося к сносу. Между главными героями – Кусуке и Науцумэ (это личное имя девочки, не путать с фамилией известных духовидцев) – происходит ссора, оборачивающаяся трагедий. Неожиданно сам дом и пробравшиеся в него дети оказываются посреди открытого моря, где дрейфуют другие старые здания, хорошо знакомые, но давно снесенные. Что это? Шанс изменить судьбу? Отвратить трагедию? Или сказать друг другу нечто очень важное, что давно хотелось, но никак не получалось? И чем закончиться это плавание? И смогут ли все дети вернуться домой, или кто-то все же должен будет остаться в этом странном водном мире?"
                } 
            ]
            }
        }
    }
</script>

<template>
    <v-container>
        <h1 class="mt-15 pa-3" id="films">Аниме-фильмы</h1>
    <v-row  class="fill-height">
      <v-col  v-for="anime in animefilms" :key="anime.id" lg="4" md="6" sm="12" xs="12">
        <v-card>
          <v-row no-gutters>
            <v-col xs="12">
          <img contain :src="`./src/assets/${anime.posterUrl}`" width="200px" height="300px" class="ma-3"> 
            </v-col>
            <v-col>
          <v-card-title>{{anime.titlerussian}}</v-card-title>  
          <v-card-subtitle>{{anime.titlejapanese}}</v-card-subtitle>
            <v-chip class="ma-2" v-for="genre in anime.genres" :key="genre.idG">{{genre.genreName}}</v-chip>
          <v-card-text>{{anime.season}}</v-card-text>
            </v-col>
            </v-row>  
          <v-expansion-panels>
            <v-expansion-panel>
                <v-expansion-panel-title>
                    Описание
                </v-expansion-panel-title>
                <v-expansion-panel-text>
                    {{anime.about}}
                </v-expansion-panel-text>
            </v-expansion-panel>
            </v-expansion-panels>
        </v-card>
      </v-col>
      </v-row>
      </v-container>  
</template>