<script>
 export default {
        name: "AnimeCard",
        data () {
            return {
                animes: [
                {
                    id: 0,
                    titlerussian: "Необъятный океан",
                    titlejapanese: "Grand Blue",
                    season: "лето-2018",
                    genres: [{idG: 0, genreName: "комедия"}, {idG: 1, genreName: "повседневность"}],
                    posterUrl: "grandblue-tv-1.jpg",
                    about: "Среди океанских волн и лучей сияющего солнца вблизи города Идзу, Иори Китахара, новоспеченный первокурсник в университете Идзу только начинает свою учебу. Когда он переезжает в магазин для подводного плавания своего дяди, Grand Blue, он с нетерпением ожидает своей долгожданной жизни в колледже, наполненной красивыми девушками и хорошими друзьями. Но все идет не совсем по плану. Войдя в магазин, он встречает группу шумных, полуголых старшекурсников, которые немедленно сконяют его участвовать в их алкогольных приключениях..."
                },
                {
                    id: 1,
                    titlerussian: "Необъятный океан TV-2",
                    titlejapanese: "Grand Blue TV-2",
                    season: "лето-2025",
                    genres: [{idG: 0, genreName: "комедия"}, {idG: 1, genreName: "повседневность"}],
                    posterUrl: "grandblue-tv-2.jpg",
                    about: "Продолжение эпического ситкома про Иори Китахару и его друзей. Смотреть лучше под чай-улун! Еще одна порция хороших гэгов, кринжа, романтики, моря и солнца. Ура лету! И так как хорошие ситкомы можно продолжать почти бесконечно, то ждем продолжения в 2026 году (уже анонсировано)."
                },
                {
                    id: 2,
                    titlerussian: "Запрещённый крот",
                    titlejapanese: "Dekin no Mogura",
                    season: "лето-2025",
                    genres: [{idG: 0, genreName: "комедия"}, {idG: 1, genreName: "повседневность"}, {idG: 2, genreName: "мистика"}],
                    posterUrl: "deki-no-mogura.jpg",
                    about:"Как-то паре студентов филфака попадается странный мужик с фонарем. Оказывается, потустороннее ближе, чем кажется: можно пройти мимо и ничего не увидеть (человек вообще склонен подстраивать окружающую картинку под себя), а можно присмотреться. Вот только во втором случае будь готов к странным событиям, встречам, разговорам, а то и опасностям! Впрочем, если ты фольклорист, то сам бог велел окунуться в дела давно забытых дней, а заодно можно и порасспросить тех, кто пережил не только вторую мировую, но и эпоху, когда о европейских кораблях еще слыхом не слыхивали."
                },
                {
                    id: 3,
                    titlerussian: "Лето, когда погас свет",
                    titlejapanese: "Hikaru ga Shinda Natsu",
                    season: "лето-2025",
                    genres: [{idG: 0, genreName: "триллер"}, {idG: 1, genreName: "детектив"}, {idG: 2, genreName: "мистика"}, {idG: 3, genreName: "драма"}],
                    posterUrl: "hukaru-ga-shinda-natsu.jpg",
                    about: "С некоторого времени Ёшики стал замечать, что его друг Хикару – вовсе не Хикару, что его телом завладела какая-то сущность. Осталось понять – это какой-то ёкай из японского фольклора, или пришелец с другой планеты, или, может быть, нечто совершенно невообразимое… Роскошнейшая графика и атмосфера до мурашек, а если кого пугают триллеры, так тут ничего прямо-таки противного нет, есть странное, есть держащее в напряжении, но есть же, кстати, и трогательное, и милое, и по-детски чистое. Это только начало закрученной истории, ждем второй сезон!"
                },
                {
                    id: 4,
                    titlerussian: "Обычный роман в Цзюлуне",
                    titlejapanese: "Kowloon Generic Romance",
                    season: "весна-2025",
                    genres: [{idG: 0, genreName: "детектив"}, {idG: 1, genreName: "романтика"}, {idG: 2, genreName: "повседневность"}],
                    posterUrl: "kowloon-generic-romance.jpg",
                    about: "Вообще слово \"обычный\" тут не очень подходит, просто краткий и четкий перевод тут сложно придумать. Дженерик - это некий аналог (лекарства, например), вроде бы оно, а вроде и нет, состав тот же, но... Что если район, который снесли несколько лет назад, снова возникает на месте развалин? Возникает выборочно, кому-то открытый, кому-то нет. Там живут люди, жившие там несколько лет назад, там лето и подсолнухи, там строятся отношения и закручивается сюжет. Сюжет и отношения сложные, многоступенчатые, и все это в ностальгической манере девяностых и в любовно, детально прорисованных пейзажах же."
                },
                {
                    id: 5,
                    titlerussian: "Ведьмнадзор",
                    titlejapanese: "Witch Watch",
                    season: "весна-2025",
                    genres: [{idG: 0, genreName: "комедия"}, {idG: 1, genreName: "фэнтези"}, {idG: 2, genreName: "повседневность"}],
                    posterUrl: "witch-watch-tv1.jpg",
                    about: "Невероятно милый и ламповый ситком про талантливую, но неуклюжую ведьму и ее серьезного педантичного фамильяра. Будут тенгу, оборотни, колдуны, много волшебства, хотя основное волшебство тут в повседневных моментах, в дружеских посиделках, в мелких и не очень неурядицах и прочих составляющих действительно хорошего ситкома. Отдельного внимания заслуживает опенинг, он нереально роскошен!"
                } 
            ]
            }
        }
    }
</script>

<template>
    <v-container>
    <h1 class="mt-15 pa-3" id="tv">Аниме-сериалы</h1>
    <v-row  class="fill-height">
      <v-col  v-for="anime in animes" :key="anime.id" lg="4" md="6" sm="12" xs="12">
        <v-card>
          <v-row no-gutters>
            <v-col xs="12">
          <img contain :src="`./src/assets/${anime.posterUrl}`" width="200px" height="300px" class="ma-3"> 
            </v-col>
            <v-col>
          <v-card-title >{{anime.titlerussian}}</v-card-title>  
          <v-card-subtitle>{{anime.titlejapanese}}</v-card-subtitle>
            <v-chip class="ma-2" v-for="genre in anime.genres" :key="genre.idG">{{genre.genreName}}</v-chip>
          <v-card-text>{{anime.season}}</v-card-text>
            </v-col>
            </v-row>  
          <v-expansion-panels>
            <v-expansion-panel>
                <v-expansion-panel-title>
                    Описание
                </v-expansion-panel-title>
                <v-expansion-panel-text>
                    {{anime.about}}
                </v-expansion-panel-text>
            </v-expansion-panel>
            </v-expansion-panels>
        </v-card>
      </v-col>
      </v-row>
    </v-container>  
</template>