{
    "filterAnimes": [
        {
            "name": "TV",
            "slug": "tv",
            "id": 1,
            "animes": [
                {
                    "idA": 0,
                    "slug": "grandblue-tv-1",
                    "titlerussian": "Необъятный океан",
                    "titlejapanese": "Grand Blue",
                    "season": "лето-2018",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "комедия"
                        },
                        {
                            "idG": 1,
                            "genreName": "повседневность"
                        }
                    ],
                    "posterUrl": "grandblue-tv-1.jpg",
                    "about": "Среди океанских волн и лучей сияющего солнца вблизи города Идзу, Иори Китахара, новоспеченный первокурсник в университете Идзу только начинает свою учебу. Когда он переезжает в магазин для подводного плавания своего дяди, Grand Blue, он с нетерпением ожидает своей долгожданной жизни в колледже, наполненной красивыми девушками и хорошими друзьями. Но все идет не совсем по плану. Войдя в магазин, он встречает группу шумных, полуголых старшекурсников, которые немедленно сконяют его участвовать в их алкогольных приключениях..."
                },
                {
                    "idA": 1,
                    "slug": "grandblue-tv-2",
                    "titlerussian": "Необъятный океан TV-2",
                    "titlejapanese": "Grand Blue TV-2",
                    "season": "лето-2025",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "комедия"
                        },
                        {
                            "idG": 1,
                            "genreName": "повседневность"
                        }
                    ],
                    "posterUrl": "grandblue-tv-2.jpg",
                    "about": "Продолжение эпического ситкома про Иори Китахару и его друзей. Смотреть лучше под чай-улун! Еще одна порция хороших гэгов, кринжа, романтики, моря и солнца. Ура лету! И так как хорошие ситкомы можно продолжать почти бесконечно, то ждем продолжения в 2026 году (уже анонсировано)."
                },
                {
                    "idA": 2,
                    "slug": "deki-no-mogura",
                    "titlerussian": "Запрещённый крот",
                    "titlejapanese": "Dekin no Mogura",
                    "season": "лето-2025",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "комедия"
                        },
                        {
                            "idG": 1,
                            "genreName": "повседневность"
                        },
                        {
                            "idG": 2,
                            "genreName": "мистика"
                        }
                    ],
                    "posterUrl": "deki-no-mogura.jpg",
                    "about": "Как-то паре студентов филфака попадается странный мужик с фонарем. Оказывается, потустороннее ближе, чем кажется: можно пройти мимо и ничего не увидеть (человек вообще склонен подстраивать окружающую картинку под себя), а можно присмотреться. Вот только во втором случае будь готов к странным событиям, встречам, разговорам, а то и опасностям! Впрочем, если ты фольклорист, то сам бог велел окунуться в дела давно забытых дней, а заодно можно и порасспросить тех, кто пережил не только вторую мировую, но и эпоху, когда о европейских кораблях еще слыхом не слыхивали."
                },
                {
                    "idA": 3,
                    "slug": "hukaru-ga-shinda-natsu",
                    "titlerussian": "Лето, когда погас свет",
                    "titlejapanese": "Hikaru ga Shinda Natsu",
                    "season": "лето-2025",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "триллер"
                        },
                        {
                            "idG": 1,
                            "genreName": "детектив"
                        },
                        {
                            "idG": 2,
                            "genreName": "мистика"
                        },
                        {
                            "idG": 3,
                            "genreName": "драма"
                        }
                    ],
                    "posterUrl": "hukaru-ga-shinda-natsu.jpg",
                    "about": "С некоторого времени Ёшики стал замечать, что его друг Хикару – вовсе не Хикару, что его телом завладела какая-то сущность. Осталось понять – это какой-то ёкай из японского фольклора, или пришелец с другой планеты, или, может быть, нечто совершенно невообразимое… Роскошнейшая графика и атмосфера до мурашек, а если кого пугают триллеры, так тут ничего прямо-таки противного нет, есть странное, есть держащее в напряжении, но есть же, кстати, и трогательное, и милое, и по-детски чистое. Это только начало закрученной истории, ждем второй сезон!"
                },
                {
                    "idA": 4,
                    "slug": "kowloon-generic-romance",
                    "titlerussian": "Обычный роман в Цзюлуне",
                    "titlejapanese": "Kowloon Generic Romance",
                    "season": "весна-2025",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "детектив"
                        },
                        {
                            "idG": 1,
                            "genreName": "романтика"
                        },
                        {
                            "idG": 2,
                            "genreName": "повседневность"
                        }
                    ],
                    "posterUrl": "kowloon-generic-romance.jpg",
                    "about": "Вообще слово \"обычный\" тут не очень подходит, просто краткий и четкий перевод тут сложно придумать. Дженерик - это некий аналог (лекарства, например), вроде бы оно, а вроде и нет, состав тот же, но... Что если район, который снесли несколько лет назад, снова возникает на месте развалин? Возникает выборочно, кому-то открытый, кому-то нет. Там живут люди, жившие там несколько лет назад, там лето и подсолнухи, там строятся отношения и закручивается сюжет. Сюжет и отношения сложные, многоступенчатые, и все это в ностальгической манере девяностых и в любовно, детально прорисованных пейзажах же."
                },
                {
                    "idA": 5,
                    "slug": "witch-watch-tv1",
                    "titlerussian": "Ведьмнадзор",
                    "titlejapanese": "Witch Watch",
                    "season": "весна-2025",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "комедия"
                        },
                        {
                            "idG": 1,
                            "genreName": "фэнтези"
                        },
                        {
                            "idG": 2,
                            "genreName": "повседневность"
                        }
                    ],
                    "posterUrl": "witch-watch-tv1.jpg",
                    "about": "Невероятно милый и ламповый ситком про талантливую, но неуклюжую ведьму и ее серьезного педантичного фамильяра. Будут тенгу, оборотни, колдуны, много волшебства, хотя основное волшебство тут в повседневных моментах, в дружеских посиделках, в мелких и не очень неурядицах и прочих составляющих действительно хорошего ситкома. Отдельного внимания заслуживает опенинг, он нереально роскошен!"
                }
            ]
        },
        {
            "name": "Фильмы",
            "slug": "film",
            "id": 2,
            "animes": [
                {
                    "idA": 0,
                    "slug": "kimi-no-iro",
                    "titlerussian": "Твой цвет",
                    "titlejapanese": "Kimi no Iro",
                    "season": "30.08.2024",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "драма"
                        }
                    ],
                    "posterUrl": "kimi-no-iro.jpg",
                    "about": "Тоцуко, старшеклассница с удивительным даром, видит цвета эмоций людей вокруг. Её мир переливается оттенками счастья, восторга и умиротворения, но один цвет кажется ей особенным, словно предначертанным судьбой. Когда Тоцуко, Кими и их друг Руи создают музыкальную группу, творчество помогает друзьям понять себя и друг друга."
                },
                {
                    "idA": 1,
                    "slug": "oglyanis",
                    "titlerussian": "Оглянись",
                    "titlejapanese": "ルックバック",
                    "season": "28.06.2024",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "повседневность"
                        },
                        {
                            "idG": 1,
                            "genreName": "драма"
                        }
                    ],
                    "posterUrl": "oglyanis.jpg",
                    "about": "Ученица четвёртого класса Фудзино, уверенная в себе и в своих способностях, рисует короткие комиксы для школьной газеты. Взрослые и одноклассники хвалят её талант, но однажды она встречает соперницу — одноклассницу Кёмото, которая, хоть и не посещает школу, тоже рисует для той же газеты. Поражённая уровнем мастерства Кёмото и пытаясь угнаться за ней, Фудзино бросает все силы на то, чтобы научиться лучше рисовать, но все её усилия тщетны. И тогда девочка бросает попытки догнать соперницу и возвращается к обычной школьной жизни. Всё меняет день, когда они волею судеб встретились…"
                },
                {
                    "idA": 2,
                    "slug": "suki-demo-kirai-na-amanojaku",
                    "titlerussian": "Моя подруга демон",
                    "titlejapanese": "Suki demo Kirai na Amanojaku",
                    "season": "24.05.2024",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "приключения"
                        },
                        {
                            "idG": 1,
                            "genreName": "фэнтэзи"
                        }
                    ],
                    "posterUrl": "suki-demo-kirai-na-amanojaku.jpg",
                    "about": "Хиираги безуспешно пытается завести друзей, но в сущности никому не нужен и не интересен. Случайно, на летнем фестивале он знакомится со странной девушкой Цумуги, которая ищет свою мать в человеческом мире. Вместе они отправляются в путешествие к таинственному храму, преследуемые опасными существами – то ли снежными богами, то ли монстрами."
                },
                {
                    "idA": 3,
                    "slug": "komada-jouryuusho-e-youkoso",
                    "titlerussian": "Винокурня семьи Комада",
                    "titlejapanese": "Komada Jouryuusho e Youkoso",
                    "season": "10.11.2023",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "повседневность"
                        }
                    ],
                    "posterUrl": "komada-jouryuusho-e-youkoso.jpg",
                    "about": "В юности Руи была вынуждена взять на себя управление винокурней семейства Комада. Ещё при её отце производство серьёзно пострадало от землетрясения, и ей пришлось бросить учёбу, чтобы снова поставить его на ноги. Хотя сейчас винокурня процветает, девушка не может забыть о былых успехах. Она планирует воссоздать фирменный виски «Кома», который символизирует для неё единство их семьи. Однажды в винокурню по работе приезжает молодой репортер Котаро Такахаси, который поначалу не испытывает особого интереса к месту, но постепенно втягивается в тонкий и неторопливый процесс изготовления виски и проникается философией его употребления. Он решает помочь Руи в исполнении мечты."
                },
                {
                    "idA": 4,
                    "slug": "hokkyoku-hyakkaten-no-concierge-san",
                    "titlerussian": "Консьерж универмага Арктика",
                    "titlejapanese": "Hokkyoku Hyakkaten no Concierge-san",
                    "season": "20.10.2023",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "фэнтези"
                        }
                    ],
                    "posterUrl": "hokkyoku-hyakkaten-no-concierge-san.jpg",
                    "about": "Производственная драмеди про любимую японцами философию сервиса в мире антропоморфных животных и людей. Акино постигает тонкости работы консьержа в огромном роскошном универсаме \"Арктика\", где рады каждому покупателю, от мала до велика, и где на любой кошелёк найдётся своя заветная покупка. Потому что клиент должен уходить из универсама счастливым - и возвращаться снова!"
                },
                {
                    "idA": 5,
                    "slug": "ame-o-tsugeru-hyouryuu-danchi",
                    "titlerussian": "Плавучий дом",
                    "titlejapanese": "Ame o Tsugeru Hyouryuu Danchi",
                    "season": "16.09.2022",
                    "genres": [
                        {
                            "idG": 0,
                            "genreName": "приключения"
                        }
                    ],
                    "posterUrl": "ame-o-tsugeru-hyouryuu-danchi.jpg",
                    "about": "Группа детей из 6-го класса младшей школы (по 11 лет от роду) забирается на крышу старого дома, готовящегося к сносу. Между главными героями – Кусуке и Науцумэ (это личное имя девочки, не путать с фамилией известных духовидцев) – происходит ссора, оборачивающаяся трагедий. Неожиданно сам дом и пробравшиеся в него дети оказываются посреди открытого моря, где дрейфуют другие старые здания, хорошо знакомые, но давно снесенные. Что это? Шанс изменить судьбу? Отвратить трагедию? Или сказать друг другу нечто очень важное, что давно хотелось, но никак не получалось? И чем закончиться это плавание? И смогут ли все дети вернуться домой, или кто-то все же должен будет остаться в этом странном водном мире?"
                }
            ]
        }
    ]
}